SaitoYutaka/incubator-nuttx/boards/arm/nrf51/microbit/src/nrf51_userleds.c
/****************************************************************************
 * boards/arm/nrf51/microbit/src/nrf51_userleds.c
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Author:  Janne Rosberg <janne@offcode.fi>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <arch/board/board.h>

#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"

#include "nrf51-generic.h"
#include "nrf51_rtc.h"
#ifndef CONFIG_ARCH_LEDS

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LED definitions **********************************************************/

/* If CONFIG_ARCH_LEDS is not defined, then the LEDs are completely under
 * control of the application.  The following interfaces are then available
 * for application control of the LEDs:
 *
 *  void board_userled_initialize(void);
 *  void board_userled(int led, bool ledon);
 *  void board_userled_all(uint8_t ledset);
 */

#ifdef CONFIG_NRF51_GENERIC_LED_ACTIVELOW
#define LED_ON 0
#define LED_OFF 1
#else
#define LED_ON 1
#define LED_OFF 0
#endif

static const uint32_t ascii_table[] = 
{
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // 32:Space
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0110010010111101001010010, // 65:A
    0b1110010010111001001011100, // 66:B
    0b0111010000100001000001110, // 67:C
    0b1110010010100101001011100, // 68:D
    0b1111010000111001000011110, // 69:E
    0b1111010000111001000010000, // 70:F
    0b0111010000100111000101110, // 71:G
    0b1001010010111101001010010, // 72:H
    0b1110001000010000100011100, // 73:I
    0b1111100010000101001001100, // 74:J
    0b1001010100110001010010010, // 75:K
    0b1000010000100001000011110, // 76:L
    0b1000111011101011000110001, // 77:M
    0b1000111001101011001110001, // 78:N
    0b0110010010100101001001100, // 79:O
    0b1110010010111001000010000, // 80:P
    0b0110010010100100110000110, // 81:Q
    0b1110010010111001001010001, // 82:R
    0b0111010000011000001011100, // 83:S
    0b1111100100001000010000100, // 84:T
    0b1001010010100101001001100, // 85:U
    0b1000110001100010101000100, // 86:V
    0b1000110001101011101110001, // 87:W
    0b1001010010011001001010010, // 88:X
    0b1000101010001000010000100, // 89:Y
    0b1111000100010001000011110, // 90:Z
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
    0b0000000000000000000000000, // NOT YET
};
/* This array maps an LED number to GPIO pin configuration */

