SaitoYutaka/incubator-nuttx/boards/arm/nrf51/microbit/src/nrf51_userleds.c
static const uint32_t g_ledcfg[BOARD_NLEDS] =
{
// #if 0 < BOARD_NLEDS
//   GPIO_LED1,
// #endif
// #if 1 < BOARD_NLEDS
//   GPIO_LED2,
// #endif
// #if 2 < BOARD_NLEDS
//   GPIO_LED3,
// #endif
// #if 3 < BOARD_NLEDS
//   GPIO_LED4,
// #endif
  GPIO_LED_ROW3,
  GPIO_LED_ROW2,
  GPIO_LED_ROW1,
  GPIO_LED_COL9,
  GPIO_LED_COL8,
  GPIO_LED_COL7,
  GPIO_LED_COL6,
  GPIO_LED_COL5,
  GPIO_LED_COL4,
  GPIO_LED_COL3,
  GPIO_LED_COL2,
  GPIO_LED_COL1,
};

static uint8_t microbit_led = 0;
/****************************************************************************
 * Private Functions
 ****************************************************************************/
#define ROW3 (1<<15)
#define ROW2 (1<<14)
#define ROW1 (1<<13)
#define COL9 (1<<12)
#define COL8 (1<<11)
#define COL7 (1<<10)
#define COL6 (1<<9)
#define COL5 (1<<8)
#define COL4 (1<<7)
#define COL3 (1<<6)
#define COL2 (1<<5)
#define COL1 (1<<4)
#define ALL_LEDS (ROW3 | ROW2 | ROW1 | COL9 | COL8 | COL7 | COL6 | COL5 | COL4 | COL3 | COL2 | COL1)
#define ALL_COLS (COL9 | COL8 | COL7 | COL6 | COL5 | COL4 | COL3 | COL2 | COL1)
#define ALL_ROWS (ROW3 | ROW2 | ROW1)

int row = 0x0;
int col = 0x0;
static void led_on(int led, int sel)
{
/*
        [R1/C1] [R2/C4] [R1/C2] [R2/C5] [R1/C3]
        [R3/C4] [R3/C5] [R3/C6] [R3/C7] [R3/C8]
  BTN A [R2/C2] [R1/C9] [R2/C3] [R3/C9] [R2/C1] BTN B
        [R1/C8] [R1/C7] [R1/C6] [R1/C5] [R1/C4]
        [R3/C3] [R2/C7] [R3/C1] [R2/C6] [R3/C2]
*/
  // int output = 0x0;
  // int row = 0x0;
  // int col = 0x0;
  // modifyreg32(NRF51_GPIO0_DIRSET, 0, ALL_LEDS);
  // putreg32(ALL_LEDS, NRF51_GPIO0_DIRSET);
  // 118 fe31

  row = 0x0;
  col = 0x0;
  switch(sel){
    case 1:
      if(led & 0b1000000000000000000000000) { row |= ROW1; col |= COL1;} // [R1/C1]
      if(led & 0b0010000000000000000000000) { row |= ROW1; col |= COL2;} // [R1/C2]
      if(led & 0b0000100000000000000000000) { row |= ROW1; col |= COL3;} // [R1/C3]
      if(led & 0b0000000000010000000000000) { row |= ROW1; col |= COL9;} // [R1/C9]
      if(led & 0b0000000000000001000000000) { row |= ROW1; col |= COL8;} // [R1/C8]
      if(led & 0b0000000000000000100000000) { row |= ROW1; col |= COL7;} // [R1/C7]
      if(led & 0b0000000000000000010000000) { row |= ROW1; col |= COL6;} // [R1/C6]
      if(led & 0b0000000000000000001000000) { row |= ROW1; col |= COL5;} // [R1/C5]
      if(led & 0b0000000000000000000100000) { row |= ROW1; col |= COL4;} // [R1/C4]
      break;
    case 2:
      if(led & 0b0100000000000000000000000) { row |= ROW2; col |= COL4;} // [R2/C4]
      if(led & 0b0001000000000000000000000) { row |= ROW2; col |= COL5;} // [R2/C5]
      if(led & 0b0000000000100000000000000) { row |= ROW2; col |= COL2;} // [R2/C2]
      if(led & 0b0000000000001000000000000) { row |= ROW2; col |= COL3;} // [R2/C3]
      if(led & 0b0000000000000010000000000) { row |= ROW2; col |= COL1;} // [R2/C1]
      if(led & 0b0000000000000000000001000) { row |= ROW2; col |= COL7;} // [R2/C7]
      if(led & 0b0000000000000000000000010) { row |= ROW2; col |= COL6;} // [R2/C6]
      break;
    case 3:
      if(led & 0b0000010000000000000000000) { row |= ROW3; col |= COL4;} // [R3/C4]
      if(led & 0b0000001000000000000000000) { row |= ROW3; col |= COL5;} // [R3/C5]
      if(led & 0b0000000100000000000000000) { row |= ROW3; col |= COL6;} // [R3/C6]
      if(led & 0b0000000010000000000000000) { row |= ROW3; col |= COL7;} // [R3/C7]
      if(led & 0b0000000001000000000000000) { row |= ROW3; col |= COL8;} // [R3/C8]
      if(led & 0b0000000000000100000000000) { row |= ROW3; col |= COL9;} // [R3/C9]
      if(led & 0b0000000000000000000010000) { row |= ROW3; col |= COL3;} // [R3/C3]
      if(led & 0b0000000000000000000000100) { row |= ROW3; col |= COL1;} // [R3/C1]
      if(led & 0b0000000000000000000000001) { row |= ROW3; col |= COL2;} // [R3/C2]
      break;
  }

  // if(led & 0b1000000000000000000000000) { row |= ROW1; col |= COL1;} // [R1/C1]
  // if(led & 0b0100000000000000000000000) { row |= ROW2; col |= COL4;} // [R2/C4]
  // if(led & 0b0010000000000000000000000) { row |= ROW1; col |= COL2;} // [R1/C2]
  // if(led & 0b0001000000000000000000000) { row |= ROW2; col |= COL5;} // [R2/C5]
  // if(led & 0b0000100000000000000000000) { row |= ROW1; col |= COL3;} // [R1/C3]

  // if(led & 0b0000010000000000000000000) { row |= ROW3; col |= COL4;} // [R3/C4]
  // if(led & 0b0000001000000000000000000) { row |= ROW3; col |= COL5;} // [R3/C5]
  // if(led & 0b0000000100000000000000000) { row |= ROW3; col |= COL6;} // [R3/C6]
  // if(led & 0b0000000010000000000000000) { row |= ROW3; col |= COL7;} // [R3/C7]
  // if(led & 0b0000000001000000000000000) { row |= ROW3; col |= COL8;} // [R3/C8]

  // if(led & 0b0000000000100000000000000) { row |= ROW2; col |= COL2;} // [R2/C2]
  // if(led & 0b0000000000010000000000000) { row |= ROW1; col |= COL9;} // [R1/C9]
  // if(led & 0b0000000000001000000000000) { row |= ROW2; col |= COL3;} // [R2/C3]
  // if(led & 0b0000000000000100000000000) { row |= ROW3; col |= COL9;} // [R3/C9]
  // if(led & 0b0000000000000010000000000) { row |= ROW2; col |= COL1;} // [R2/C1]

  // if(led & 0b0000000000000001000000000) { row |= ROW1; col |= COL8;} // [R1/C8]
  // if(led & 0b0000000000000000100000000) { row |= ROW1; col |= COL7;} // [R1/C7]
  // if(led & 0b0000000000000000010000000) { row |= ROW1; col |= COL6;} // [R1/C6]
  // if(led & 0b0000000000000000001000000) { row |= ROW1; col |= COL5;} // [R1/C5]
  // if(led & 0b0000000000000000000100000) { row |= ROW1; col |= COL4;} // [R1/C4]

  // if(led & 0b0000000000000000000010000) { row |= ROW3; col |= COL3;} // [R3/C3]
  // if(led & 0b0000000000000000000001000) { row |= ROW2; col |= COL7;} // [R2/C7]
  // if(led & 0b0000000000000000000000100) { row |= ROW3; col |= COL1;} // [R3/C1]
  // if(led & 0b0000000000000000000000010) { row |= ROW2; col |= COL6;} // [R2/C6]
  // if(led & 0b0000000000000000000000001) { row |= ROW3; col |= COL2;} // [R3/C2]

///////
  // if(led & 0x00000001) { row |= ROW1; col |= COL1;} // [R1/C1]
  // if(led & 0x00000002) { row |= ROW2; col |= COL4;} // [R2/C4]
  // if(led & 0x00000004) { row |= ROW1; col |= COL2;} // [R1/C2]
  // if(led & 0x00000008) { row |= ROW2; col |= COL5;} // [R2/C5]
  // if(led & 0x00000010) { row |= ROW1; col |= COL3;} // [R1/C3]

  // if(led & 0x00000020) { row |= ROW3; col |= COL4;} // [R3/C4]
  // if(led & 0x00000040) { row |= ROW3; col |= COL5;} // [R3/C5]
  // if(led & 0x00000080) { row |= ROW3; col |= COL6;} // [R3/C6]
  // if(led & 0x00000100) { row |= ROW3; col |= COL7;} // [R3/C7]
  // if(led & 0x00000200) { row |= ROW3; col |= COL8;} // [R3/C8]

  // if(led & 0x00000400) { row |= ROW2; col |= COL2;} // [R2/C2]
  // if(led & 0x00000800) { row |= ROW1; col |= COL9;} // [R1/C9]
  // if(led & 0x00001000) { row |= ROW2; col |= COL3;} // [R2/C3]
  // if(led & 0x00002000) { row |= ROW3; col |= COL9;} // [R3/C9]
  // if(led & 0x00004000) { row |= ROW2; col |= COL1;} // [R2/C1]

