SaitoYutaka/incubator-nuttx/boards/arm/nrf51/microbit/src/nrf51_userleds.c
  // if(led & 0x00008000) { row |= ROW1; col |= COL8;} // [R1/C8]
  // if(led & 0x00010000) { row |= ROW1; col |= COL7;} // [R1/C7]
  // if(led & 0x00020000) { row |= ROW1; col |= COL6;} // [R1/C6]
  // if(led & 0x00040000) { row |= ROW1; col |= COL5;} // [R1/C5]
  // if(led & 0x00080000) { row |= ROW1; col |= COL4;} // [R1/C4]

  // if(led & 0x00100000) { row |= ROW3; col |= COL3;} // [R3/C3]
  // if(led & 0x00200000) { row |= ROW2; col |= COL7;} // [R2/C7]
  // if(led & 0x00400000) { row |= ROW3; col |= COL1;} // [R3/C1]
  // if(led & 0x00800000) { row |= ROW2; col |= COL6;} // [R2/C6]
  // if(led & 0x01000000) { row |= ROW3; col |= COL2;} // [R3/C2]

  // ledinfo("row %x col %x\n", row, col);
  // ledinfo("NRF51_GPIO0_DIRSET %x\n", getreg32(NRF51_GPIO0_DIRSET));
  // ledinfo("NRF51_GPIO0_OUTCLR %x\n", getreg32(NRF51_GPIO0_OUTCLR));
  // ledinfo("NRF51_GPIO0_OUTSET %x\n", getreg32(NRF51_GPIO0_OUTSET));

  // modifyreg32(NRF51_GPIO0_DIRCLR, 0, ALL_LEDS);
  // modifyreg32(NRF51_GPIO0_OUTCLR, 0, ALL_LEDS);
  // modifyreg32(NRF51_GPIO0_DIRSET, ALL_LEDS, row | col);
  // modifyreg32(NRF51_GPIO0_OUTCLR, ALL_COLS, col);
  // modifyreg32(NRF51_GPIO0_OUTSET, ALL_ROWS, row); // ON

  // putreg32(((getreg32(NRF51_GPIO0_DIRSET) & ~ALL_LEDS) | (row | col)), NRF51_GPIO0_DIRSET);
  // putreg32(((getreg32(NRF51_GPIO0_OUTCLR) & ~ALL_LEDS) | col), NRF51_GPIO0_OUTCLR);
  // putreg32(((getreg32(NRF51_GPIO0_OUTSET) & ~ALL_LEDS) | row), NRF51_GPIO0_OUTSET);
  // putreg32(row | col, NRF51_GPIO0_DIRSET);
  // putreg32(col, NRF51_GPIO0_OUTCLR);
  // putreg32(row, NRF51_GPIO0_OUTSET); // ON
  // putreg32((1<<ROW1)|(1<<ROW2)|(1<<COL1)|(1<<COL4)|(1<<COL2)|(1<<COL5)|(1<<COL3), NRF51_GPIO0_DIRSET);
  // putreg32((1<<COL1)|(1<<COL4)|(1<<COL2)|(1<<COL5)|(1<<COL3), NRF51_GPIO0_OUTCLR);
  // putreg32((1<<ROW1)|(1<<ROW2), NRF51_GPIO0_OUTSET); // ON
  return;
}

static void microbit_display(
  char led01, char led02, char led03, char led04, char led05, 
  char led06, char led07, char led08, char led09, char led10, 
  char led11, char led12, char led13, char led14, char led15, 
  char led16, char led17, char led18, char led19, char led20, 
  char led21, char led22, char led23, char led24, char led25 
   )
{
  int output = 0x0;
  if(led01 == 1){ output |= 0x0000001; }
  if(led02 == 1){ output |= 0x0000002; }
  if(led03 == 1){ output |= 0x0000004; }
  if(led04 == 1){ output |= 0x0000008; }
  if(led05 == 1){ output |= 0x0000010; }
  if(led06 == 1){ output |= 0x0000020; }
  if(led07 == 1){ output |= 0x0000040; }
  if(led08 == 1){ output |= 0x0000080; }
  if(led09 == 1){ output |= 0x0000100; }
  if(led10 == 1){ output |= 0x0000200; }
  if(led11 == 1){ output |= 0x0000400; }
  if(led12 == 1){ output |= 0x0000800; }
  if(led13 == 1){ output |= 0x0001000; }
  if(led14 == 1){ output |= 0x0002000; }
  if(led15 == 1){ output |= 0x0004000; }
  if(led16 == 1){ output |= 0x0008000; }
  if(led17 == 1){ output |= 0x0010000; }
  if(led18 == 1){ output |= 0x0020000; }
  if(led19 == 1){ output |= 0x0040000; }
  if(led20 == 1){ output |= 0x0080000; }
  if(led21 == 1){ output |= 0x0100000; }
  if(led22 == 1){ output |= 0x0200000; }
  if(led23 == 1){ output |= 0x0400000; }
  if(led24 == 1){ output |= 0x0800000; }
  if(led25 == 1){ output |= 0x1000000; }
  ledinfo("output %x\n", output);
  // led_on(output);
  return;
}

/****************************************************************************
 * Name: led_dumppins
 ****************************************************************************/

#ifdef LED_VERBOSE
static void led_dumppins(FAR const char *msg)
{
  nrf51_pin_dump(PINCONFIG_LED, msg);
  nrf51_gpio_dump(GPIO_LED, msg);
}
#else
#  define led_dumppins(m)
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: board_userled_initialize
 ****************************************************************************/
static uint8_t microbit_cnt = 1;
static uint8_t microbit_switch = 0;
static int nrf51_microbitled(int irq, uint32_t *regs, void *arg)
{
  if(getreg32(NRF51_RTC0_TICK)){
    putreg32(0x0, NRF51_RTC0_TICK);
    putreg32(NRF51_RTC0_BIT_TICK, NRF51_RTC0_EVTENCLR); // clear
    // nxsched_process_timer();
    microbit_cnt++;
    // if(microbit_cnt % 20 == 0){
    if(1){
      ledinfo("nrf51_microbitled\n");
      microbit_cnt = 1;
      // led_on(ascii_table[66]);


      switch(microbit_switch){
        case 0:
          microbit_switch = 1;
          led_on(ascii_table[66], 1);
          modifyreg32(NRF51_GPIO0_DIRCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_OUTCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_DIRSET, ALL_LEDS, row | col);
          modifyreg32(NRF51_GPIO0_OUTCLR, ALL_COLS, col);
          modifyreg32(NRF51_GPIO0_OUTSET, ALL_ROWS, row); // ON
          break;
        case 1:
          microbit_switch = 2;
          led_on(ascii_table[66], 2);
          modifyreg32(NRF51_GPIO0_DIRCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_OUTCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_DIRSET, ALL_LEDS, row | col);
          modifyreg32(NRF51_GPIO0_OUTCLR, ALL_COLS, col);
          modifyreg32(NRF51_GPIO0_OUTSET, ALL_ROWS, row); // ON
          break;
        case 2:
          microbit_switch = 0;
          led_on(ascii_table[66], 3);
          modifyreg32(NRF51_GPIO0_DIRCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_OUTCLR, 0, ALL_LEDS);
          modifyreg32(NRF51_GPIO0_DIRSET, ALL_LEDS, row | col);
          modifyreg32(NRF51_GPIO0_OUTCLR, ALL_COLS, col);
          modifyreg32(NRF51_GPIO0_OUTSET, ALL_ROWS, row); // ON
          break;
        default:
          break;
      }

      // switch(microbit_switch){
      //   case 0:
      //     microbit_switch = 1;
      //     microbit_display(
      //       1,0,1,0,1,
      //       0,0,0,0,0,
      //       0,1,0,0,0,
      //       1,1,1,1,1,
      //       0,0,0,0,0
      //     );
      //     break;
      //   case 1:
      //     microbit_switch = 2;
      //     microbit_display(
      //       0,0,0,0,0,
      //       1,1,1,1,1,
      //       0,0,0,1,0,
      //       0,0,0,0,0,
      //       1,0,1,0,1
      //     );
      //     break;
      //   case 2:
      //     microbit_switch = 0;
      //     microbit_display(
      //       0,1,0,1,0,
      //       0,0,0,0,0,
      //       1,0,1,0,1,
      //       0,0,0,0,0,
      //       0,1,0,1,0
      //     );
      //     break;
      //   default:
      //     break;
      // }
    }
  }
  return 0;
}

