SaitoYutaka/incubator-nuttx/boards/arm/nrf51/microbit/src/nrf51_userleds.c
void board_userled_initialize(void)
{
  // int i;

  // /* Configure LED pin as a GPIO outputs */

  // led_dumppins("board_userled_initialize() Entry)");

  // /* Configure GPIO as an outputs */

  // for (i = 0; i < BOARD_NLEDS; i++)
  //   {
  //     nrf51_gpio_config(g_ledcfg[i]);
  //   }

  // led_dumppins("board_userled_initialize() Exit");
  (void)irq_attach(NRF51_IRQ_RTC0, (xcpt_t)nrf51_microbitled, NULL);
  up_enable_irq(NRF51_IRQ_RTC0);

  // putreg32(0xFFF, NRF51_RTC0_PRESCALER); // PRESCALER
  putreg32(60, NRF51_RTC0_PRESCALER); // PRESCALER

  putreg32(NRF51_RTC0_BIT_TICK, NRF51_RTC0_INTENCLR); // INTENCLR
  putreg32(NRF51_RTC0_BIT_TICK, NRF51_RTC0_INTEN); // EVTENSET
  putreg32(NRF51_RTC0_BIT_TICK, NRF51_RTC0_INTENSET); // EVTENSET
  putreg32(1, NRF51_RTC0_START); // START
}

/****************************************************************************
 * Name: board_userled
 ****************************************************************************/

void board_userled(int led, bool ledon)
{
  if ((unsigned)led < BOARD_NLEDS)
    {
      nrf51_gpio_write(g_ledcfg[led], ledon ? LED_ON : LED_OFF);
    }
}

/****************************************************************************
 * Name: board_userled_all
 ****************************************************************************/


void board_userled_all(uint8_t ledset)
{
  // int i;

  /* Configure LED1-8 GPIOs for output */
  ledinfo("ledset %x\n", ledset);
  microbit_led = ledset;
  // for (i = 0; i < BOARD_NLEDS; i++)
  //   {
  //     nrf51_gpio_write(g_ledcfg[i], (ledset & (1 << i)) ? LED_ON : LED_OFF);
  //   }
  // if(ledset == 0) return ;

}

#endif /* !CONFIG_ARCH_LEDS */
